import React from 'react'
import { TextDiv } from '../../styles/Style'

const Terms: React.FC = () => {
  return (
    <TextDiv>
      <h1>Пользовательское соглашение</h1>
      <p>1. Общие положения и термины</p>
      <blockquote>
        1.1. Данный документ является договором на использование нашего сайта.
        Ниже приведены правила и условия использования Сервиса. Пожалуйста,
        внимательно ознакомьтесь с ними.
        <br /> 1.2. Сервисом могут пользоваться пользователи достигшие 18-ти
        летия.
        <br /> 1.3 Организаторы беспроигрышной онлайн игры магазина кейсов
        никого насильно не заставляют проводить свой досуг на этом проекте.
      </blockquote>
      <p>2. Учеетная запись и безопасность</p>
      <blockquote>
        Для открытия Учетной Записи пользователь должен авторизоваться через
        Вконтакте. Пользователь несет полную ответственность за хранение
        конфиденциальной информации, за потерю доступа к своей Учетной Записи.
        Кроме того, пользователь несет полную ответственность за любые
        совершенные им действия. Сервис не несет ответственности за поступки,
        совершенные Пользователем в отношении третьих лиц. Пользователь
        обязуется сообщить Сервису о любом несанкционированном использовании его
        Учетной записи.
      </blockquote>
      <p>3. Конфиденциальность</p>
      <blockquote>
        Сервис обязуется не редактировать и не раскрывать любую конфиденциальную
        информацию, предоставленную Пользователем Сервису. Сервис также
        обязуется хранить личный пароль пользователя в зашифрованном виде.
        Личные данные могут быть предоставлены третьим лицам лишь в связи с
        нарушением законодательства, а также оскорблением или клеветой в
        отношении брендов или торговых марок третьих лиц.
      </blockquote>
      <p>4. Пользователь</p>
      <blockquote>
        Сервис оставляет за собой право в любой момент блокировать Пользователя
        в связи с нарушением правил использования Сервиса или законодательства.
        Неприемлемы попытки несанкционированного доступа, попытки нанесения
        вреда Сервису. При добавлении на сайт любой информации, запрещены
        оскорбления, вымогательства, клевета, блеф, сообщения, содержащие
        вредоносную информацию (в т.ч. вирусы, трояны, черви и т.п.), а также
        информация, способная нанести вред третьим лицам.
      </blockquote>
      <p>5. Ограничения</p>
      <blockquote>
        5.1 Запрещается публиковать фальсифицированные данные <br /> 5.2
        Запрещается передача любых материалов, которые могут нарушить
        интеллектуальную собственность третьих лиц <br /> 5.3 Запрещаются
        фальшивые публикации информации с целью получения несанкционированных
        доступов к информации или данным третьих лиц <br /> 5.4 Запрещается
        публикация информации религиозного и политического характера <br /> 5.5
        Запрещается регистрировать более одной Учетной Записи <br /> 5.6
        Запрещается передавать данные для доступа к Учетной записи третьим лицам
        <br /> 5.7 Запрещается оскорблять, обзывать, ставить под сомнение
        профессиональную квалификацию и добросовестность физических и
        юридических лиц, в том числе Пользователей Сервиса и Администрации
        Сервиса. <br /> 5.8 Запрещается выбирать себе аватары, содержащие сцены
        насилия, угрозы, сквернословия, разврат (порнография), дискриминация в
        любых проявлениях, коммерческая реклама и рекламные тексты
      </blockquote>
      <p>6. Принятие условия соглашения</p>
      <blockquote>
        6.1 Зарегистрировавшись в Сервисе, Вы, тем самым, принимаете условия
        настоящего Соглашения.
      </blockquote>
      <p>7. Права</p>
      <blockquote>
        7.1. Исключительное право на Сервис принадлежит Сервису
        <br /> 7.2. Все права на материалы, представленные на нашем сайте,
        принадлежат Правообладателям
      </blockquote>
    </TextDiv>
  )
}

export default Terms
